[[https://www.python.org/dev/peps/pep-0203/][PEP 203 Augmented Assignments]]

增加的语法
* +=
* -=
* *=
* /=
* %=
* **=
* <<=
* >>=
* &=
* ^=
* |=

x+=y

x 先加载,然后加上 y,得到的结果存回 y

原地操作,不产生新对象

#+BEGIN_SRC python :session :results output pp
  import dis


  def test():
      a = 3
      b = 4
      a += b
      return a


  print('{}:'.format(test.__name__))
  dis.dis(test)


  def test_new_object():
      a = 3
      b = 4
      a = a + b
      return a


  print('{}:'.format(test_new_object.__name__))
  dis.dis(test_new_object)
#+END_SRC

#+RESULTS:
#+begin_example
test:
  5           0 LOAD_CONST               1 (3)
              2 STORE_FAST               0 (a)

  6           4 LOAD_CONST               2 (4)
              6 STORE_FAST               1 (b)

  7           8 LOAD_FAST                0 (a)
             10 LOAD_FAST                1 (b)
             12 INPLACE_ADD
             14 STORE_FAST               0 (a)

  8          16 LOAD_FAST                0 (a)
             18 RETURN_VALUE
test_new_object:
 16           0 LOAD_CONST               1 (3)
              2 STORE_FAST               0 (a)

 17           4 LOAD_CONST               2 (4)
              6 STORE_FAST               1 (b)

 18           8 LOAD_FAST                0 (a)
             10 LOAD_FAST                1 (b)
             12 BINARY_ADD
             14 STORE_FAST               0 (a)

 19          16 LOAD_FAST                0 (a)
             18 RETURN_VALUE
#+end_example
